In [1]:
import pandas

In [2]:
import pandas as pd

In [3]:
pd

In [4]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
a = [1, 2, 3, 4]

In [6]:
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
mylist = [1, 2, 3, 4]
pd.Series(mylist)

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 1000, '자동차'],
           ['네이버', 500, '포털']]

In [9]:
pd.DataFrame(company1)

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [10]:
df1 = pd.DataFrame(company1)

In [11]:
df1

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [12]:
df1.columns = ['기업명', '매출액', '업종']

In [13]:
df1

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [14]:
company2 = {'기업명':['삼성', '현대', '네이버'], 
            '매출액': [2000, 1000, 500], 
            '업종': ['스마트폰', '자동차', '포털']
           }

In [15]:
df2 = pd.DataFrame(company2)

In [16]:
df2

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [17]:
df2 = pd.DataFrame(company2['기업명'])

In [18]:
df2

     0
0   삼성
1   현대
2  네이버

In [19]:
df2 = pd.DataFrame(company2)

In [20]:
df1

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [21]:
df1.index = df1['기업명']

In [22]:
df1

     기업명   매출액    업종
기업명
삼성    삼성  2000  스마트폰
현대    현대  1000   자동차
네이버  네이버   500    포털

In [23]:
df1['매출액']

기업명
삼성     2000
현대     1000
네이버     500
Name: 매출액, dtype: int64

In [24]:
type(df1['매출액'])

pandas.core.series.Series